tutorials/cgnsConverters/test3/case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

//nu              nu [0 2 -1 0 0 0 0] 8.99e-07;
nu              nu [0 2 -1 0 0 0 0] 1.0e-2;

CrossPowerLawCoeffs
{
    nu0             nu0 [0 2 -1 0 0 0 0] 0;
    nuInf           nuInf [0 2 -1 0 0 0 0] 0;
    m               <> [0 0 0 0 0 0 0] 0;
    n               <> [0 0 0 0 0 0 0] 0;
}

BirdCarreauCoeffs
{
    nu0             nu0 [0 2 -1 0 0 0 0] 0;
    nuInf           nuInf [0 2 -1 0 0 0 0] 0;
    k               <> [0 0 0 0 0 0 0] 0;
    n               <> [0 0 0 0 0 0 0] 0;
}


// ************************************************************************* //
