tutorials/cgnsConverters/test3/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
2916
(
(-16.19179428 2.321176435 -0.6057549475)
(-6.745930624 1.51478828 -0.3179105799)
(-3.283999971 1.530000642 -0.1736888888)
(-1.160739178 1.498076994 -0.05710168759)
(0.2692141833 1.350599332 0.07214605202)
(0.8304713604 1.047880358 0.1475484535)
(0.8509944019 0.6197125333 0.1473187957)
(0.4702374049 0.2182213503 0.08767101196)
...
)
;

boundaryField
{
    hub
    {
        type            calculated;
        value           nonuniform List<vector> 
324
(
(-5.154478377 0.2993644528 -5.157615419)
(-4.424998815 0.02454317351 -4.42306269)
(-4.419133315 -0.1923398299 -4.425576315)
(-4.40158244 -0.4084876683 -4.428089252)
(-4.372870815 -0.622927144 -4.430014752)
(-4.333740627 -0.8348807504 -4.430844002)
(-4.284971127 -1.0438249 -4.430350127)
(-4.227221502 -1.249484651 -4.428639877)
...
)
;
    }
    inflow
    {
        type            calculated;
        value           nonuniform List<vector> 
162
(
(-3.173824064 -3.511464922 0)
(-3.403349566 -3.765408031 0)
(-3.403349566 -3.765408031 0)
(-3.403349567 -3.765408031 0)
(-3.403349566 -3.765408031 0)
(-3.403349566 -3.765408031 0)
(-3.403349567 -3.765408031 0)
(-3.403349567 -3.765408031 0)
...
)
;
    }
    outflow
    {
        type            calculated;
        value           nonuniform List<vector> 
162
(
(-23.7287496 3.193758278 -0.80337926)
(-23.62034759 2.264446958 -0.4730518139)
(-23.17516565 0.5876848797 0.02885095137)
(-22.35437524 -1.908272703 0.4448994845)
(-21.86470064 -4.9629433 0.4753164588)
(-21.92860618 -7.684974022 0.05685908383)
(-21.88623421 -9.511246742 -0.4946064787)
(-21.63927172 -10.65715094 -0.9068921144)
...
)
;
    }
    perio1_1_and_perio1_2
    {
        type            cyclic;
        value           nonuniform List<vector> 
486
(
(-16.22466378 2.773517249 -0.7489681629)
(-6.782212788 1.760696515 -0.4291965754)
(-3.317986288 1.718543883 -0.2755364604)
(-1.1804821 1.672538214 -0.1522730989)
(0.292075671 1.531444298 -0.01016512265)
(0.9191590788 1.232038735 0.09484385626)
(0.9772078439 0.7696029915 0.1319224698)
(0.5692302701 0.2952446255 0.09758071148)
...
)
;
    }
    shroud
    {
        type            calculated;
        value           nonuniform List<vector> 
324
(
(-10.48799364 1.555206907 -0.2318318522)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
...
)
;
    }
}


// ************************************************************************* //
