tutorials/cgnsConverters/test3/case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
2916
(
163.3891013
328.77411
387.5277773
415.0537759
417.9194667
415.2190154
412.9161607
413.0917206
...
)
;

boundaryField
{
    hub
    {
        type            calculated;
        value           nonuniform List<scalar> 
324
(
280.637946
296.2244805
296.2207419
296.2247729
296.2296994
296.2353984
296.2434196
296.2538426
...
)
;
    }
    inflow
    {
        type            calculated;
        value           nonuniform List<scalar> 
162
(
440.592385
439.141419
434.9610301
432.3026329
430.663525
429.6383492
429.0514389
428.7787255
...
)
;
    }
    outflow
    {
        type            calculated;
        value           nonuniform List<scalar> 
162
(
22.77495964
22.75707648
22.79146618
22.80534464
22.6359044
22.32969703
22.1060322
22.07010935
...
)
;
    }
    perio1_1_and_perio1_2
    {
        type            cyclic;
        value           nonuniform List<scalar> 
486
(
163.5601702
329.0267165
387.9855451
415.5953974
418.1321842
415.1031261
412.6014676
412.7116841
...
)
;
    }
    shroud
    {
        type            calculated;
        value           nonuniform List<scalar> 
324
(
169.4076936
328.0912401
387.2720353
415.2002508
418.0626745
415.3015296
412.9250585
413.0712893
...
)
;
    }
}


// ************************************************************************* //
