tutorials/cgnsConverters/test3/case/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
2916
(
3.712158393
2.722603002
1.739035061
1.137920893
0.6799731381
0.472549263
0.5024179645
0.4781470625
...
)
;

boundaryField
{
    hub
    {
        type            calculated;
        value           nonuniform List<scalar> 
324
(
0.1827383231
0.1659765248
0.1662325265
0.1664588752
0.1666068017
0.1666430552
0.1665560392
0.1663518529
...
)
;
    }
    inflow
    {
        type            calculated;
        value           nonuniform List<scalar> 
162
(
2.052762135
2.194167677
2.192039265
2.19064348
2.190068217
2.189955942
2.190167016
2.190890162
...
)
;
    }
    outflow
    {
        type            calculated;
        value           nonuniform List<scalar> 
162
(
4.060905907
4.575138606
6.144036726
7.918920609
7.541380076
5.691401042
4.630873234
4.213452867
...
)
;
    }
    perio1_1_and_perio1_2
    {
        type            cyclic;
        value           nonuniform List<scalar> 
486
(
3.414001576
2.538614867
1.65763633
1.116756904
0.6954613918
0.4738383227
0.4658070743
0.4353558362
...
)
;
    }
    shroud
    {
        type            calculated;
        value           nonuniform List<scalar> 
324
(
2.976960844
2.185315117
1.464633567
1.007789102
0.6117573814
0.4138337383
0.4113679251
0.4060344472
...
)
;
    }
}


// ************************************************************************* //
