tutorials/cgnsConverters/test3/case/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
2916
(
0.4421707564
0.3598798254
0.2697039722
0.2021523052
0.1410793323
0.1121656908
0.1181415526
0.117685762
...
)
;

boundaryField
{
    hub
    {
        type            calculated;
        value           nonuniform List<scalar> 
324
(
0.1015051452
0.09967461789
0.09963633716
0.09959662055
0.09954844591
0.0994919125
0.09943203858
0.09937519072
...
)
;
    }
    inflow
    {
        type            calculated;
        value           nonuniform List<scalar> 
162
(
0.1583283002
0.1612756693
0.1594252765
0.1581868886
0.1576731186
0.1575797288
0.1577868517
0.1584656994
...
)
;
    }
    outflow
    {
        type            calculated;
        value           nonuniform List<scalar> 
162
(
0.4684574845
0.5113183424
0.6120834547
0.7095871035
0.6822335951
0.5802096683
0.5174128884
0.4799096868
...
)
;
    }
    perio1_1_and_perio1_2
    {
        type            cyclic;
        value           nonuniform List<scalar> 
486
(
0.4124846694
0.338784184
0.257495023
0.1974068746
0.1422707636
0.1116208923
0.1116057328
0.1099702983
...
)
;
    }
    shroud
    {
        type            calculated;
        value           nonuniform List<scalar> 
324
(
0.3435123665
0.2775742694
0.2135728912
0.1650595282
0.1174499559
0.09216231073
0.09200394107
0.09118652628
...
)
;
    }
}


// ************************************************************************* //
